{
    "welcome-name": "Hello! My name is",
    "stack-frontend": "Frontend Developer",
    "stack-fullstack": "Full Stack Developer",
    "welcome-first-description": "Welcome to my portfolio! I am a frontend web developer with a strong foundation in React, TypeScript, and responsive design.",
    "welcome-second-description": "Experience in backend development with Node.js, Express, and NestJS.",
    "welcome-third-description": "My focus is on creating intuitive and scalable applications.",
    "able-to-work": "Available to work",
    "download-cv": "Download CV",
    "select-language": "Select Language",
    "language-english": "English",
    "language-spanish": "Spanish",
    "confirm-download": "Confirm download",
    "hard-skills": "Technical Skills",
    "soft-skills": "Soft Skills",
    "frontend": "Frontend",
    "backend": "Backend",
    "others": "Others",
    "adaptability": "Adaptability",
    "communication": "Communication",
    "creative": "Creativity",
    "time-management": "Time Management",
    "initiative": "Initiative",
    "organization": "Organization",
    "critical-thinking": "Critical Thinking",
    "problem-solving": "Problem Solving",
    "responsability": "Responsibility",
    "teamwork": "Teamwork",
    "projects": "Projects",
  
    "saludnet-title": "SaludNet | Health Platform",
    "saludnet-description": "SaludNet is a digital telemedicine platform designed to simplify and optimize access to health services. It allows patients to receive medical care remotely and providers to manage consultations more efficiently. With advanced features for scheduling appointments, issuing orders and digital prescriptions, accessing medical records, and conducting video consultations, SaludNet improves the experience for both patients and medical professionals, and also facilitates the administration of services.",
  
    "uptask-title": "Uptask | Project Manager",
    "uptask-description": "Task application, including an authentication system. Express was used for the Backend and Mongoose to connect it with the MongoDB database. React for the Frontend and styled with Tailwind, Chakra, Headlessui, and Drag and drop implemented with DND Kit. The project uses TypeScript in both stacks and React Query for data management.",
  
    "ecommerce-frontend-title": "Ecommerce | Frontend",
    "ecommerce-frontend-description": "In our final React project at Coderhouse, we created an E-commerce where the goal was to be able to buy the selected products. Featuring a cart and a purchase form. Hosting the data in Firebase. Thus learning the basics of this library.",
  
    "cryptostatus-title": "CryptoStatus | Cryptocurrency Quoter",
    "cryptostatus-description": "Real-time cryptocurrency information, connected to CryptoCompare API. The idea of this project was to continue practicing with React, adding TypeScript to learn its basic concepts. Tailwind was used for the design, Zod for data validation, and Zustand for state management.",
  
    "myrestaurant-title": "My Restaurant",
    "myrestaurant-description": "Simulates the management of a restaurant. The employee can interact with the menu, add products to the order list, calculate the customer's tip, and generate the total to issue a ticket. This project aims to reinforce my skills in React and delve into the basic concepts of TypeScript. Additionally, TailwindCSS was used to create a clean and responsive design. I plan to expand its functionalities in the future to continue developing and improving this application, exploring new technologies and use cases.",
  
    "ecommerce-fullstack-title": "Ecommerce | Full Stack",
    "ecommerce-fullstack-description": "Final project of the Backend Programming course, Coderhouse. We created a functional REST API, using views with Handlebars.js. Allowing users to make purchases, with STRIPE payment gateway. The ADMIN user can perform CRUD operations on products and edit or delete users. API documentation with Swagger.",
  
    "visit-website": "Visit Website",
    "about": "About Me",
    "about-beginning": "Beginnings",
    "about-beginning-description": "At the end of 2022, I started my journey in programming attracted by the challenge of solving problems and creating web applications. Since then, I have focused my efforts on developing practical skills and a mindset oriented towards continuous learning.",
  
    "about-bios": "Bios",
    "about-bios-description": "I started my studies by taking courses such as Programming Fundamentals and Java Programming. Here I learned the basics of programming and started building layered J2SE applications, with MySQL database access via JDBC and graphical interfaces with Swing.",
  
    "about-coderhouse": "Coderhouse",
    "about-coderhouse-description": "I continued my studies and completed the Full Stack Web Developer Career. I successfully completed this training, facing constant challenges that reinforced my technical skills and problem-solving ability.",
  
    "about-udemy": "Udemy",
    "about-udemy-description": "On Udemy, I am taking the React + Typescript course, a powerful combination for modern user interface development.",
  
    "about-language": "Languages",
    "about-language-description": "I am studying English, Level B2 and preparing for the First Certificate. Constantly improving to read technical documentation and collaborate internationally.",
  
    "about-objetives": "Objectives 2025",
    "about-objetives-description": "Get my first job as a frontend developer, adding value with my technical skills and proactive attitude.",
  
    "about-vision": "Vision",
    "about-vision-description": "I am motivated by continuous learning and the possibility of contributing to challenging projects that have a positive impact. My goal is to excel in the world of web development and be prepared to adapt to emerging technologies in the future.",
  
    "contact": "Contact",
    "contact-letstalk": "Let's Talk",
    "contact-interested": "Are you interested in contacting me?",
    "contact-interested-send": "Send me a message by email or on any of my social networks!",
    "contact-send": "Send a message",
    "contact-socialmedia": "Social Media",
    "contact-phone": "Phone",
  
    "footer-developedby": "Developed and designed by"
    }